[
  {
    "id": "mortification-of-sin",
    "title": "The Mortification of Sin",
    "author": "John Owen",
    "year": 1656,
    "description": "A profound treatise on putting sin to death in the believer's life, essential reading for understanding sanctification.",
    "topics": ["Sanctification", "Sin", "Christian Living", "Puritan Theology"],
    "chapters": [
      {
        "id": 1,
        "title": "The Necessity of Mortification",
        "content": "Be killing sin or it will be killing you. No man shall ever live that comfortable, holy, useful, fruitful life which becomes a Christian, who is not deeply engaged in the constant work of mortifying indwelling sin. Without this, a man may seem to live, but he is dead while he lives; he may profess, but he will never enjoy communion with God. He may be an excellent man, as to gifts and common graces, but will be a withered, sapless, unsightly tree in the garden of the Lord.\n\nThis great work of killing sin involves the soul in a constant engagement. It is a work not of a day, but of our whole lives. We cannot say that we have finished the work of mortification because the matter is complex and the opposition is durable.\n\nThe choicest believers, who are assuredly freed from the condemning power of sin, ought yet to make it their business all their days to mortify the indwelling power of sin."
      },
      {
        "id": 2,
        "title": "What Mortification Is",
        "content": "Mortification is the constant weakening of lust and sin in the heart, so as to prevent them from breaking forth into scandalous acts. It is the habitual weakening of sin, and the vivification or quickening of grace. To kill a man, or any other living thing, is to take away the principle of all his strength, vigour, and power, so that he cannot act or exert, or put forth any proper actions of his own; so it is in this case.\n\nThe mortification of sin is not the utter destruction of a sin, but the constant weakening of it. Sin will not be utterly destroyed until our death; but it may be so weakened that, though it still acts, its actions are weak, dying, and easily conquered. This is what we aim at.\n\nWe must be satisfied with nothing less than the constant weakening of every lust, and the strengthening of the new man of grace in the contrary grace."
      },
      {
        "id": 3,
        "title": "By Whom This Work Is To Be Done",
        "content": "The Holy Spirit is the only author of this work. All ways and means without Him are as a thing of nought; and He is the great efficient, without whom we can do nothing. Yet He works by means, and the chief means He uses is the Word of God.\n\nAs the Spirit alone can mortify sin, so the Spirit alone can give us such an understanding of the evil and guilt and danger of sin as will produce true mortification. This is His peculiar work.\n\nThough the Spirit is the author, yet He expects our diligent use of the means which He has appointed for this end. We are workers together with God. We are not merely passive, but we are to be humbly and diligently active in the work of mortification, always in dependence upon the Spirit for success."
      }
    ]
  },
  {
    "id": "bruised-reed",
    "title": "The Bruised Reed",
    "author": "Richard Sibbes",
    "year": 1630,
    "description": "A tender exploration of Christ's gentleness with weak believers, offering comfort to struggling souls.",
    "topics": ["Grace", "Comfort", "Weak Faith", "Christ's Character"],
    "chapters": [
      {
        "id": 1,
        "title": "Christ's Tender Care",
        "content": "A bruised reed shall he not break, and smoking flax shall he not quench, till he send forth judgment unto victory. This is a sweet portion of Scripture, full of comfort for poor distressed souls.\n\nChrist will not break the bruised reed, nor quench the smoking flax. What is meant by bruised reed and smoking flax? First, those who are in themselves weak, and such as are in trouble and distress of mind. They see their wants, bewail their weakness, and feel their pressure so that they are ready to fall into despair.\n\nChrist's manner of dealing with such souls is full of gentleness. He knows our mould, that we are but dust. He will not break that which is bruised already, nor quench that small measure of grace which sends up weak desires to heaven like smoky breath.\n\nThis gives great encouragement to weak Christians. Though grace be small, it is true grace if it comes from Christ. A small spark is fire as well as a great flame."
      },
      {
        "id": 2,
        "title": "The Nature of Bruised Reeds",
        "content": "What manner of people are resembled by bruised reeds? Those that are brought to feel their sins and miseries, that are poor in spirit, that mourn for sin, that thirst after righteousness.\n\nThese bruised ones are sensible of their burden. They see their sin and misery; they feel the weight of God's displeasure; they apprehend the curse of the law; they are pressed down under the sense of God's wrath. Yet withal they have some little hope, some breathing after God and goodness.\n\nThough they are bruised, they are not broken. Though they are bowed down, they are not utterly cast down. There is some sap of spiritual life in them, some moving toward God, some desire after grace and mercy. This is the smoking flax - weak, but not quite extinguished.\n\nChrist will cherish the least measure of grace and the weakest degree of goodness. He will not despise the day of small things."
      }
    ]
  },
  {
    "id": "body-of-divinity",
    "title": "A Body of Divinity",
    "author": "Thomas Watson",
    "year": 1692,
    "description": "A systematic exploration of Christian doctrine through exposition of the Westminster Shorter Catechism.",
    "topics": ["Systematic Theology", "Westminster Catechism", "Christian Doctrine"],
    "chapters": [
      {
        "id": 1,
        "title": "Man's Chief End",
        "content": "What is the chief end of man? Man's chief end is to glorify God, and to enjoy him for ever.\n\nThe chief end of man is to glorify God. This is the diamond in the ring, the principal thing aimed at. God made us for his own praise. 'This people have I formed for myself; they shall shew forth my praise.' We are called God's glory.\n\nTo glorify God is to think and speak highly of him, and to act for his honor. God's glory is the result of his perfections. As the sun's brightness is the result of its nature, so God's glory is the brightness and luster of his attributes shining forth.\n\nWe glorify God actively when we make it our design to honor him; passively, when we are made instances of his mercy or justice. The vessels of mercy glorify God by being saved; the vessels of wrath glorify him by being damned.\n\nThis chief end teaches us that we must not live to ourselves. Self is too narrow a bottom for a man to build his happiness upon. We must live to higher and nobler purposes - to honor God who gave us our being."
      },
      {
        "id": 2,
        "title": "How We May Know God",
        "content": "What rule hath God given to direct us how we may glorify and enjoy him? The Word of God, which is contained in the Scriptures of the Old and New Testament, is the only rule to direct us how we may glorify and enjoy him.\n\nThe Scripture is our compass by which we steer to glory. The Scripture is both our directory and diary: it shows us the way we should walk, and it reports how others have walked in this way before us.\n\nThe Scripture is like the pool of Bethesda: there is a healing virtue in it for all spiritual diseases. It is called 'the sword of the Spirit,' because the Spirit of God wields and manages it. When Satan tempted Christ, our Savior drew this sword: 'It is written.'\n\nThe Scripture has authority from God. It is God-breathed. The penmen of Scripture wrote as they were moved by the Holy Ghost. They were not merely secretaries to take down what was dictated, but instruments that the Spirit of God used.\n\nThe Scripture is a complete rule. It is perfect, containing everything needed for salvation and godliness. We are not to add to it or take from it."
      }
    ]
  }
]